{
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-ACCT",
    "1": "B-ADDR",
    "2": "B-CC",
    "3": "B-DLN",
    "4": "B-EMAIL",
    "5": "B-NAME",
    "6": "B-PASS",
    "7": "B-PHONE",
    "8": "B-SSN",
    "9": "I-ACCT",
    "10": "I-ADDR",
    "11": "I-CC",
    "12": "I-DLN",
    "13": "I-EMAIL",
    "14": "I-NAME",
    "15": "I-PASS",
    "16": "I-PHONE",
    "17": "I-SSN",
    "18": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ACCT": 0,
    "B-ADDR": 1,
    "B-CC": 2,
    "B-DLN": 3,
    "B-EMAIL": 4,
    "B-NAME": 5,
    "B-PASS": 6,
    "B-PHONE": 7,
    "B-SSN": 8,
    "I-ACCT": 9,
    "I-ADDR": 10,
    "I-CC": 11,
    "I-DLN": 12,
    "I-EMAIL": 13,
    "I-NAME": 14,
    "I-PASS": 15,
    "I-PHONE": 16,
    "I-SSN": 17,
    "O": 18
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "torch_dtype": "float32",
  "transformers_version": "4.55.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 35000
}
